faustomon/RELED-LPC845/src/1-modulos/02-gpio/Gpio.h
/*******************************************************************************************************************************//**
 *
 * @file		gpio.h
 * @brief		Breve descripción del objetivo del Módulo
 * @date		22/6/2024
 * @author		Grupo 2
 *
 **********************************************************************************************************************************/
/***********************************************************************************************************************************
 *** MODULO
 **********************************************************************************************************************************/

#ifndef GPIO_H_
#define GPIO_H_

/***********************************************************************************************************************************
 *** INCLUDES GLOBALES
 **********************************************************************************************************************************/
#include "Inputs.h"
#include "Outputs.h"
#include "LPC845.h"

/***********************************************************************************************************************************
 *** DEFINES GLOBALES
 **********************************************************************************************************************************/

const uint8_t IOCON_INDEX_PIO0[] = { 17,11,6,5,4,3,16,15,4,13,8,7,2,1,18,10,9,0,30,29,28,27,26,25,24,23,22,21,20,0,0,35};
const uint8_t IOCON_INDEX_PIO1[] = { 36,37,3,41,42,43,46,49,31,32,55,54,33,34,39,40,44,45,47,48,52,53,0,0,0,0,0,0,0,50,51};

/***********************************************************************************************************************************
 *** MACROS GLOBALES
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 *** TIPO DE DATOS GLOBALES
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 *** VARIABLES GLOBALES
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 *** IMPLANTACION DE LA CLASE
 **********************************************************************************************************************************/
class Gpio : public Outputs ,  public Inputs
{
	protected:
		const 	uint8_t m_port ;
		const 	uint8_t m_bit ;
		const 	uint8_t m_modo ;
				uint8_t m_direccion ;
		const 	uint8_t m_actividad ;
				int8_t  m_error ;
	public:
		enum port_t			{ PORT0 , PORT1 };
		enum max_bits_port_t{ B_PORT0 = 31 , B_PORT1 = 31 };
		enum direction_t	{ INPUT , OUTPUT };
		enum power_t		{ OFF , ON };
		enum mode_output_t 	{ PUSHPULL , OPENCOLECTOR }; // el orden esta atado a las hojas de datos
		enum mode_input_t 	{ INACTIVE , PULLDOWN , PULLUP , REPEATER };
		enum activity_t		{ LOW ,	HIGH };
		enum error_t		{ ERROR = 2 , OK };

		Gpio ( uint8_t port , uint8_t bit , uint8_t mode , uint8_t activity , uint8_t direction );

		uint8_t MSetPin(uint8_t mascara);
		uint8_t MClrPin(uint8_t mascara);
		uint8_t SetPin ( void );
		uint8_t ClrPin ( void );
		uint8_t SetTogglePin ( void ) ;
		uint8_t SetDirInputs ( void )  ;
		uint8_t SetDirOutputs ( void )  ;
		uint8_t SetToggleDir ( void ) ;
		uint8_t GetPin ( void ) const ;
		uint8_t SetPinModeOut ( void )  ;
		uint8_t SetPinModeIn ( void ) ;
		Gpio& operator=( bool estado );
		bool operator== ( bool estado );
		bool operator== ( Gpio& );

		explicit operator bool( ) ;

		~Gpio (){};
};


#endif /* GPIO_H_ */
